OpenFOAM case folders/Experimental validation/Calm water resistance/KCS/Fr0.2816/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-14.558392217519799 0 -8.226488753050571)
	(21.837588326279697 0 -8.226488753050571)
	(21.837588326279697 9.22363890493549 -8.226488753050571)
	(-14.558392217519799 9.22363890493549 -8.226488753050571)
	(-14.558392217519799 0 3.7393130695684413)
	(21.837588326279697 0 3.7393130695684413)
	(21.837588326279697 9.22363890493549 3.7393130695684413)
	(-14.558392217519799 9.22363890493549 3.7393130695684413)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (146 37 48) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
			(3 2 6 7)
			(0 3 2 1)
		);
	}
	midPlane
	{
		type symmetryPlane;
		faces
		(
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

