OpenFOAM case folders/Experimental validation/Calm water resistance/KCS/Fr0.2816/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       dictionary;
	location    "constant";
	object      turbulenceProperties;
}

simulationType RAS;

RAS
{
	RASModel        kOmegaSST;
	turbulence      on;
	printCoeffs     on;
	decayControl    yes;
	kInf            0.0008493240470077441;
	omegaInf        1.6346065390884936;
}

