OpenFOAM case folders/Experimental validation/Calm water resistance/KCS/Fr0.2816/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       dictionary;
	location    "constant";
	object      dynamicMeshDict;
}

dynamicFvMesh       dynamicMotionSolverFvMesh;
motionSolverLibs    ("libsixDoFRigidBodyMotion.so");
solver              sixDoFRigidBodyMotion;

sixDoFRigidBodyMotionCoeffs
{
	patches                   (hull deck rudder);
	innerDistance             0.36393;
	outerDistance             3.6393;
	centreOfMass              (0.050285632 0.000000000 -0.111394226);
	mass                      823.7450928909294;
	momentOfInertia           (79.297902024 3644.717138029 3707.977818268);
	rhoInf                    1;
	report                    on;
	reportToFile              on;
	value                     uniform (0 0 0);
	accelerationRelaxation    0.4;
	accelerationDamping       0.9;
	solver
	{
		type    Newmark;
	}
	constraints
	{
		zAxis
		{
			sixDoFRigidBodyMotionConstraint    line;
			direction                          (0 0 1);
		}
		yPlane
		{
			sixDoFRigidBodyMotionConstraint    axis;
			axis                               (0.000000 1.000000 0);
		}
	}
	restraints
	{
		translationDamper
		{
			sixDoFRigidBodyMotionRestraint    linearDamper;
			coeff                             16980.120640041532;
		}
		rotationDamper
		{
			sixDoFRigidBodyMotionRestraint    sphericalAngularDamper;
			coeff                             76433.7308084347;
		}
	}
}

